In [1]:
import pandas as pd

In [2]:
dict1= {
    'Name':['Kartik','Abhay','Somnath','Rita'],
    'Marks':[93,34,56,70],
    'Gender':['M','M','M','F']
}

df=pd.DataFrame(dict1)        #for creating dataframe...
df

      Name  Marks Gender
0   Kartik     93      M
1    Abhay     34      M
2  Somnath     56      M
3     Rita     70      F

In [3]:
df.head(3)

      Name  Marks Gender
0   Kartik     93      M
1    Abhay     34      M
2  Somnath     56      M

In [4]:
df.tail(3)

      Name  Marks Gender
1    Abhay     34      M
2  Somnath     56      M
3     Rita     70      F

In [5]:
df.shape

(4, 3)

In [6]:
df.info

<bound method DataFrame.info of       Name  Marks Gender
0   Kartik     93      M
1    Abhay     34      M
2  Somnath     56      M
3     Rita     70      F>

In [7]:
print('Number of rows:',df.shape[0])
print('Number of columns:',df.shape[1])
print(df.dtypes)

Number of rows: 4
Number of columns: 3
Name      object
Marks      int64
Gender    object
dtype: object

In [8]:
df.isnull().sum(axis=1)           #1 for row-wise... 0 for columns...

0    0
1    0
2    0
3    0
dtype: int64

In [9]:
df.describe(include='all')                   #overall statistics about the dataset

          Name      Marks Gender
count        4   4.000000      4
unique       4        NaN      2
top     Kartik        NaN      M
freq         1        NaN      3
mean       NaN  63.250000    NaN
std        NaN  24.757154    NaN
min        NaN  34.000000    NaN
25%        NaN  50.500000    NaN
50%        NaN  63.000000    NaN
75%        NaN  75.750000    NaN
max        NaN  93.000000    NaN

In [10]:
df['Gender'].unique()        #for unique values..

array(['M', 'F'], dtype=object)

In [11]:
df['Gender'].nunique()       #for number of unique values

2

In [12]:
df['Gender'].value_counts()

Gender
M    3
F    1
Name: count, dtype: int64

In [13]:
df[df['Marks']>60]

     Name  Marks Gender
0  Kartik     93      M
3    Rita     70      F

In [14]:
df[(df['Marks']>60) & (df['Marks']<100)]         #using & operator

     Name  Marks Gender
0  Kartik     93      M
3    Rita     70      F

In [15]:
# df.Gender 
# df['Gender']
# Both are same

In [16]:
#for length

len(df[(df['Marks']>60) & (df['Marks']<100)])

2

In [17]:
df[df['Marks'].between(60,100)]                     #using between

     Name  Marks Gender
0  Kartik     93      M
3    Rita     70      F

In [18]:
df['Marks'].mean()             #avearage marks

np.float64(63.25)

Apply Method

In [19]:
def marks(x):
    return x/2          #creating function.... normal division=x/2..... floor division=x//2

In [20]:
df['Marks'].apply(marks)      #using apply

0    46.5
1    17.0
2    28.0
3    35.0
Name: Marks, dtype: float64

In [21]:
df['Half_Marks']=df['Marks'].apply(marks)
df

      Name  Marks Gender  Half_Marks
0   Kartik     93      M        46.5
1    Abhay     34      M        17.0
2  Somnath     56      M        28.0
3     Rita     70      F        35.0

In [22]:
df['Marks'].apply(lambda x:x//2)          # Lambda function

0    46
1    17
2    28
3    35
Name: Marks, dtype: int64

In [23]:
df['Name'].apply(len)         #determin the length of each value in Name column...

0    6
1    5
2    7
3    4
Name: Name, dtype: int64

Map function

In [24]:
df['Gen']=df['Gender'].map({'M':1,'F':0})       #using map function for encoding purpose...
df

      Name  Marks Gender  Half_Marks  Gen
0   Kartik     93      M        46.5    1
1    Abhay     34      M        17.0    1
2  Somnath     56      M        28.0    1
3     Rita     70      F        35.0    0

In [29]:
df.drop(['Gender','Half_Marks'],axis=1)   #for deleting in existing data... write also... inplace=True

      Name  Marks  Gen
0   Kartik     93    1
1    Abhay     34    1
2  Somnath     56    1
3     Rita     70    0

In [30]:
df.columns

Index(['Name', 'Marks', 'Gender', 'Half_Marks', 'Gen'], dtype='object')

In [31]:
df.index

RangeIndex(start=0, stop=4, step=1)

Sortring

In [35]:
df.sort_values(by=['Marks','Gender'],ascending=False)

      Name  Marks Gender  Half_Marks  Gen
0   Kartik     93      M        46.5    1
3     Rita     70      F        35.0    0
2  Somnath     56      M        28.0    1
1    Abhay     34      M        17.0    1